Chapters/Chapter_3/waveFlume_ref4/system/setFieldsDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      setFieldsDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
// This file is used to overwrite values at selected cells
defaultFieldValues
(
    volScalarFieldValue alpha.water 0 //no water
);

regions
(
    boxToCell // select all cells whose cell centre inside given bounding box
    {
        box (0 -12 -1) (368 0 1); // box (xmin ymin zmin) (xmax ymax zmax)
        fieldValues
        (
            volScalarFieldValue alpha.water 1
        );
    }
);

// ************************************************************************* //
